{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 64, 64, 3], "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"trainable": true, "padding": "same", "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "use_bias": false, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "filters": 16, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_1"}, "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "epsilon": 0.001, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": -1, "name": "batch_normalization_1", "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "padding": "same", "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "use_bias": false, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "filters": 128, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_2"}, "name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "epsilon": 0.001, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": -1, "name": "batch_normalization_2", "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "padding": "same", "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "use_bias": false, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "filters": 128, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_3"}, "name": "conv2d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "padding": "same", "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "use_bias": false, "kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "filters": 128, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_4"}, "name": "conv2d_4", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_1"}, "name": "add_1", "inbound_nodes": [[["conv2d_3", 0, 0, {}], ["conv2d_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "epsilon": 0.001, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": -1, "name": "batch_normalization_3", "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_3", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "padding": "same", "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "use_bias": false, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "filters": 128, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_5"}, "name": "conv2d_5", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "epsilon": 0.001, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": -1, "name": "batch_normalization_4", "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "padding": "same", "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "use_bias": false, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "filters": 128, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_6"}, "name": "conv2d_6", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_2"}, "name": "add_2", "inbound_nodes": [[["conv2d_6", 0, 0, {}], ["add_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "epsilon": 0.001, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": -1, "name": "batch_normalization_5", "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_5", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "name": "activation_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "padding": "same", "kernel_constraint": null, "strides": [2, 2], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "use_bias": false, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "filters": 256, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_7"}, "name": "conv2d_7", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "epsilon": 0.001, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": -1, "name": "batch_normalization_6", "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_6"}, "name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "padding": "same", "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "use_bias": false, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "filters": 256, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_8"}, "name": "conv2d_8", "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "padding": "same", "kernel_constraint": null, "strides": [2, 2], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "use_bias": false, "kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "filters": 256, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_9"}, "name": "conv2d_9", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_3"}, "name": "add_3", "inbound_nodes": [[["conv2d_8", 0, 0, {}], ["conv2d_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "epsilon": 0.001, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": -1, "name": "batch_normalization_7", "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_7", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_7"}, "name": "activation_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "padding": "same", "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "use_bias": false, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "filters": 256, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_10"}, "name": "conv2d_10", "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "epsilon": 0.001, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": -1, "name": "batch_normalization_8", "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_8"}, "name": "activation_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "padding": "same", "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "use_bias": false, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "filters": 256, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_11"}, "name": "conv2d_11", "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_4"}, "name": "add_4", "inbound_nodes": [[["conv2d_11", 0, 0, {}], ["add_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "epsilon": 0.001, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": -1, "name": "batch_normalization_9", "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_9", "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_9"}, "name": "activation_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "padding": "same", "kernel_constraint": null, "strides": [2, 2], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "use_bias": false, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "filters": 512, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_12"}, "name": "conv2d_12", "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "epsilon": 0.001, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": -1, "name": "batch_normalization_10", "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_10", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_10"}, "name": "activation_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "padding": "same", "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "use_bias": false, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "filters": 512, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_13"}, "name": "conv2d_13", "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "padding": "same", "kernel_constraint": null, "strides": [2, 2], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "use_bias": false, "kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "filters": 512, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_14"}, "name": "conv2d_14", "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_5"}, "name": "add_5", "inbound_nodes": [[["conv2d_13", 0, 0, {}], ["conv2d_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "epsilon": 0.001, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": -1, "name": "batch_normalization_11", "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_11", "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_11"}, "name": "activation_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "padding": "same", "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "use_bias": false, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "filters": 512, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_15"}, "name": "conv2d_15", "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "epsilon": 0.001, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": -1, "name": "batch_normalization_12", "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_12", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_12"}, "name": "activation_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "padding": "same", "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "use_bias": false, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "filters": 512, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_16"}, "name": "conv2d_16", "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_6"}, "name": "add_6", "inbound_nodes": [[["conv2d_16", 0, 0, {}], ["add_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "epsilon": 0.001, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": -1, "name": "batch_normalization_13", "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_13", "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_13"}, "name": "activation_13", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"trainable": true, "pool_size": [8, 8], "padding": "same", "strides": [1, 1], "data_format": "channels_last", "name": "average_pooling2d_1"}, "name": "average_pooling2d_1", "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"trainable": true, "units": 2, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "activation": "softmax", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "kernel_constraint": null, "name": "dense_1"}, "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"trainable": true, "units": 101, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "activation": "softmax", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "kernel_constraint": null, "name": "dense_2"}, "name": "dense_2", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}], "output_layers": [["dense_1", 0, 0], ["dense_2", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_1"}, "backend": "tensorflow", "keras_version": "2.0.6"}