{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"trainable": true, "dtype": "float32", "bias_constraint": null, "batch_input_shape": [null, 300, 300, 3], "padding": "valid", "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "filters": 30, "kernel_size": [3, 3], "name": "conv2d_1", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "strides": [1, 1], "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "filters": 30, "kernel_size": [3, 3], "name": "conv2d_2", "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "strides": [1, 1], "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "filters": 30, "kernel_size": [3, 3], "name": "conv2d_3", "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "strides": [1, 1], "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "name": "dense_1", "units": 1024, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 1.0}}, {"class_name": "Dense", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "name": "dense_2", "units": 2, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "softmax"}}], "keras_version": "2.0.8"}