{"config": [{"config": {"kernel_constraint": null, "padding": "valid", "filters": 30, "batch_input_shape": [null, 100, 100, 3], "kernel_size": [3, 3], "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "dtype": "float32", "activation": "linear", "name": "conv2d_1", "kernel_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"kernel_constraint": null, "padding": "valid", "filters": 30, "kernel_size": [3, 3], "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "activation": "linear", "name": "conv2d_2", "kernel_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "max_pooling2d_1", "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "padding": "valid", "filters": 30, "kernel_size": [3, 3], "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "activation": "linear", "name": "conv2d_3", "kernel_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "max_pooling2d_2", "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"units": 1024, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "name": "dense_1", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_1", "noise_shape": null, "rate": 1.0, "seed": null}, "class_name": "Dropout"}, {"config": {"units": 56, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "softmax", "name": "dense_2", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "keras_version": "2.1.2", "backend": "tensorflow", "class_name": "Sequential"}