{"config": [{"config": {"use_bias": true, "kernel_size": [3, 3], "filters": 30, "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "dtype": "float32", "data_format": "channels_last", "name": "conv2d_1", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "strides": [1, 1], "batch_input_shape": [null, 100, 100, 3], "padding": "valid", "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_size": [3, 3], "filters": 30, "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "strides": [1, 1], "padding": "valid", "name": "conv2d_2", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"use_bias": true, "kernel_size": [3, 3], "filters": 30, "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "strides": [1, 1], "padding": "valid", "name": "conv2d_3", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"use_bias": true, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "dense_1", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "units": 1024, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "trainable": true, "noise_shape": null, "seed": null, "rate": 1.0}, "class_name": "Dropout"}, {"config": {"use_bias": true, "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "dense_2", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "units": 20, "bias_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.2"}