{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "conv2d_1", "activation": "linear", "kernel_size": [3, 3], "trainable": true, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "filters": 30, "activity_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "batch_input_shape": [null, 100, 100, 3], "kernel_constraint": null, "strides": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_regularizer": null, "filters": 30, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "conv2d_2", "activation": "linear", "kernel_size": [3, 3], "trainable": true, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "strides": [1, 1], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_1", "trainable": true, "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_regularizer": null, "filters": 30, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "conv2d_3", "activation": "linear", "kernel_size": [3, 3], "trainable": true, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "strides": [1, 1], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_2", "trainable": true, "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "dense_1", "activation": "linear", "units": 1024, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "seed": null, "rate": 1.0, "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "dense_2", "activation": "softmax", "units": 20, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null}}], "backend": "tensorflow", "keras_version": "2.1.2"}